# MepAnalyticalElecCurrentRating Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepAnalyticalElecCurrentRating Property
ParameterTypeId Class See Also
---
"Current Rating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepAnalyticalElecCurrentRating { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepAnalyticalElecCurrentRating As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepAnalyticalElecCurrentRating {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace